
## Plan Result (cloudflare)

[CI link](https://github.com/nasa9084/infrastructure/actions/runs/13858750428)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.cname_exporter


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.cname_exporter will be created
  + resource "cloudflare_record" "cname_exporter" {
      + allow_overwrite = false
      + content         = "nasa9084.github.io"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "exporter"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "08db5577586403ed45dd2981644cb873"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":79,"Program":"tfcmt","SHA1":"51a0a4fbc54e0af071f5f660ef4775a2cdd504c2","Target":"cloudflare","Vars":{},"WorkflowName":"Terraform Plan"} -->